In [1]:
import pandas as pd

In [3]:
df=pd.read_excel(r"E:\durga79\EXCEL_FILES\friendsnamesq.xlsx",sheet_name="Sheet1")

In [4]:
df

  friend_names      quality
0         vani        funny
1       ayesha        funny
2       anusha     senstive
3       anitha     talktive
4        divya     talktive
5       akhila  intelligent
6      supraja     talktive
7        manoj        funny
8      harshad     talktive
9         ajay        funny

In [5]:
df_intelligent=df[df["quality"]=="intelligent"]

In [6]:
df_intelligent

  friend_names      quality
5       akhila  intelligent

In [7]:
df_funny=df[df["quality"]=="funny"]

In [8]:
df_funny

  friend_names quality
0         vani   funny
1       ayesha   funny
7        manoj   funny
9         ajay   funny

In [10]:
df=pd.read_excel(r"E:\durga79\EXCEL_FILES\friendsnamesq.xlsx",sheet_name="Sheet2")

In [11]:
df

  family_member_name     relation
0            baburao       parent
1       dhanalakshmi       parent
2           srinivas      brother
3            sravani       sister
4             kumari        pinni
5        yedukondalu        babai
6           gayathri       sister
7              radha        pinni
8              durga  grandmother
9           subbarao  grandfather

In [12]:
lst=["brother","sister"]
df[df.relation.isin(lst)]

  family_member_name relation
2           srinivas  brother
3            sravani   sister
6           gayathri   sister

In [13]:
df_parent=df[df["relation"]=="parent"]

In [14]:
df_parent

  family_member_name relation
0            baburao   parent
1       dhanalakshmi   parent

In [15]:
df_notparent=df[df['relation']!="parent"]

In [16]:
df_notparent

  family_member_name     relation
2           srinivas      brother
3            sravani       sister
4             kumari        pinni
5        yedukondalu        babai
6           gayathri       sister
7              radha        pinni
8              durga  grandmother
9           subbarao  grandfather

In [17]:
df_brother=df[df['relation']!="brother"]
df_brother

  family_member_name     relation
0            baburao       parent
1       dhanalakshmi       parent
3            sravani       sister
4             kumari        pinni
5        yedukondalu        babai
6           gayathri       sister
7              radha        pinni
8              durga  grandmother
9           subbarao  grandfather

In [18]:
df_bro_parent=df[(df["relation"]=="parent") | (df["relation"]=="brother")]

In [19]:
df_bro_parent

  family_member_name relation
0            baburao   parent
1       dhanalakshmi   parent
2           srinivas  brother

In [20]:
df_bro_parent=df[(df["relation"]!="parent") & (df["relation"]!="brother")]

In [21]:
df_bro_parent

  family_member_name     relation
3            sravani       sister
4             kumari        pinni
5        yedukondalu        babai
6           gayathri       sister
7              radha        pinni
8              durga  grandmother
9           subbarao  grandfather

In [25]:
df_bro_parent=df[(df["relation"]=="parent") & (df["relation"]=="brother")]
df_bro_parent

Empty DataFrame
Columns: [family_member_name, relation]
Index: []

In [22]:
df_bro_parent=df[(df["relation"]=="brother") & (df["family_member_name"]=="srinivas")]

In [23]:
df_bro_parent

  family_member_name relation
2           srinivas  brother

In [ ]:
lst=['parent','brother']
df[df.relation.isin(lst)]

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_excel(r"E:\durga79\friendsnamesq.xlsx",sheet_name="Sheet3")

In [ ]:
df

In [ ]:
lst=["badam_milk","semya"]
df[df.vegfoodname.isin(lst)]

In [ ]:
lst=['pappu_tomato','mushroom_curry']
df[df.vegfoodname.isin(lst)]

In [ ]:
df_fry=df[df["vegfoodname"]=="potatofry"]

In [ ]:
df_fry

In [ ]:
lst=["badam_milk","semya","potatofry"]
df[df.vegfoodname.isin(lst)]

In [ ]:
lst=["badam_milk","semya","potatofry"]
df[~df.vegfoodname.isin(lst)]

In [ ]:

df_soup_fry=df[(df["vegfoodname"]=="badam_milk")|(df["vegfoodname"]=="semya")|(df["vegfoodname"]=="potatofry")]

In [ ]:
df_soup_fry

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_excel(r"E:\durga79\friendsnamesq.xlsx",sheet_name="Sheet4")

In [ ]:
df

In [ ]:
lst=["chicken_biryani","chicken_friedrice","chicken_lolipop","chicken_manchuriya","grilled_chicken"]
df[df.nonveg_fooditems.isin(lst)]

In [ ]:
df_mutton=df[df["nonveg_fooditems"]=="mutton_curry"]

In [ ]:
df_mutton

In [ ]:
lst=["fishfry","prawns_fry"]
df[df.nonveg_fooditems.isin(lst)]

In [ ]:
lst=["chicken_biryani","chicken_friedrice","chicken_lolipop","chicken_manchuriya","grilled_chicken","fishfry","prawns_fry"]
df[df.nonveg_fooditems.isin(lst)]

In [ ]:
lst=["chicken_biryani","chicken_friedrice","chicken_lolipop","chicken_manchuriya","grilled_chicken","fishfry","prawns_fry"]
df[~df.nonveg_fooditems.isin(lst)]

In [ ]:
df_fry_mutton=df[(df["nonveg_fooditems"]=="fishfry")|(df["nonveg_fooditems"]=="prawns_fry")|(df["nonveg_fooditems"]=="mutton_curry")]

In [ ]:
df_fry_mutton

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_excel(r"E:\durga79\friendsnamesq.xlsx",sheet_name="Sheet5")

In [ ]:
df

In [ ]:
df_winter=df[df["season"]=="winter"]

In [ ]:
df_winter

In [ ]:
df_summer=df[df["season"]=="summer"]
df_summer

In [ ]:
df_rainy_season=df[df["season"]=="rainy_season"]
df_rainy_season

In [ ]:
lst=["winter","summer"]
df[df.season.isin(lst)]

In [ ]:
lst=["rainy_season","summer"]
df[~df.season.isin(lst)]

In [ ]:
df_win_rainy=df[(df["season"]=="winter")|(df["season"]=="rainy_season")]

In [ ]:
df_win_rainy

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_excel(r"E:\durga79\friendsnamesq.xlsx",sheet_name="Sheet7")

In [ ]:
df

In [ ]:
lst=["rose","hibiscus"]
df[df.flower_name.isin(lst)]

In [ ]:
lst=["lilly","jasmine",]
df[df.flower_name.isin(lst)]

In [ ]:
lst=["lotus","balsam","periwinkle","tulip"]
df[df.flower_name.isin(lst)]

In [ ]:
lst=["lotus","balsam","periwinkle","tulip","rose","hibiscus"]
df[df.flower_name.isin(lst)]

In [ ]:
lst=["red","pink"]
df[df.llower_colour_name_english.isin(lst)]

In [ ]:
lst=["red","white"]
df[df.llower_colour_name_english.isin(lst)]

In [ ]:
df_red_pink=df[(df["llower_colour_name_english"]=="red")|(df["llower_colour_name_english"]=="pink")]

In [ ]:
df_red_pink